export const HABITATS = [
  [1, '流動水域', [
    [1, '河流 < 5m', ['流水']],
    [2, '河流 > 5m', ['溪流']],
    [3, '山澗瀑布', ['山澗瀑布', '瀑布']]
  ]],
  [8, '永靜水域', [
    [28, '水域', ['水域']],
    [29, '岸邊', ['水岸']],
    [30, '植物', ['水植']]
  ]],
  [9, '暫靜水域', [
    [31, '水域', ['暫水域', '暫水']],
    [32, '岸邊', ['暫水岸']],
    [33, '植物', ['暫水植']],
    [44, '植物積水', ['植水']]
  ]],
  [10, '樹木', [
    [34, '喬木', ['喬木', '樹林']],
    [35, '灌木', ['灌木']],
    [36, '底層', ['底層']],
    [37, '竹子', ['竹子', '竹林']]
  ]],
  [6, '草地', [
    [16, '短草', ['短草']],
    [17, '高草', ['高草', '長草']]
  ]],
  [11, '人造區域', [
    [45, '邊坡', ['邊坡']],
    [38, '乾溝', ['乾溝']],
    [39, '建物', ['建物']],
    [40, '車道', ['車道']],
    [41, '步道', ['步道']],
    [42, '空地', ['空地']]
  ]],
  [12, '其他', [
    [43, '其他', ['其他']]
  ]]
]

export const HABITATS_ABBRS = []
HABITATS.forEach(type =>
  type[2].forEach(detail =>
    HABITATS_ABBRS.push(`@${type[0]}-${detail[0]}`, ...detail[2])
  )
)
