/**
 * -+ type id, type name
 *  -+ detail id, display id, name, abbrivations
 */
export const HABITATS = [
  [1, '流動水域', [
    [1, 1, '< 5m', ['流水']],
    [2, 2, '> 5m', ['溪流']],
    [3, 3, '山澗瀑布', ['山澗瀑布', '瀑布']]
  ]],
  [8, '永靜水域', [
    [28, 4, '水域', ['水域']],
    [29, 5, '岸邊', ['水岸']],
    [30, 6, '植物', ['水植']]
  ]],
  [9, '暫靜水域', [
    [31, 7, '水域', ['暫水域', '暫水']],
    [32, 8, '岸邊', ['暫水岸']],
    [33, 9, '植物', ['暫水植']],
    [44, 10, '植物積水', ['植水']]
  ]],
  [10, '樹木', [
    [34, 11, '喬木', ['喬木', '樹林']],
    [35, 12, '灌木', ['灌木']],
    [36, 13, '底層', ['底層']],
    [37, 14, '竹子', ['竹子', '竹林']]
  ]],
  [6, '草地', [
    [16, 15, '短草', ['短草']],
    [17, 16, '高草', ['高草', '長草']]
  ]],
  [11, '人造區域', [
    [45, 17, '邊坡', ['邊坡']],
    [38, 18, '乾溝', ['乾溝']],
    [39, 19, '建物', ['建物']],
    [40, 20, '車道', ['車道']],
    [41, 21, '步道', ['步道']],
    [42, 22, '空地', ['空地']]
  ]],
  [12, '其他', [
    [43, 23, '其他', ['其他']]
  ]]
]

export const HABITATS_ABBRS = []
HABITATS.forEach(type =>
  type[2].forEach(detail =>
    HABITATS_ABBRS.push(`@${detail[1]}`, ...detail[3])
  )
)
